In [60]:
import pandas as pd

In [61]:
year_1 = '1880'
year_2 = '1900'
year_3 = '1950'
year_4 = '2000'
way_file = r'C:/names'

In [62]:
df_1 = pd.read_csv(f'{way_file}/yob{year_1}.txt', names=['Name', 'Gender', 'Count'])
df_1.sort_values('Count', ascending=False).head(3)

        Name Gender  Count
942     John      M   9655
943  William      M   9532
0       Mary      F   7065

In [63]:
df_2 = pd.read_csv(f'{way_file}/yob{year_2}.txt', names=['Name', 'Gender', 'Count'])
df_2['Year'] = int(f'{year_2}')
df_3 = pd.read_csv(f'{way_file}/yob{year_3}.txt', names=['Name', 'Gender', 'Count'])
df_3['Year'] = int(f'{year_3}')
df_4 = pd.read_csv(f'{way_file}/yob{year_4}.txt', names=['Name', 'Gender', 'Count'])
df_4['Year'] = int(f'{year_4}')

In [64]:
df_res = pd.concat([df_2, df_3, df_4])
count_top3 = df_res.groupby(['Name', 'Gender']).sum()
count_top3.sort_values('Count', ascending=False).head(3)

                Count  Year
Name   Gender
James  M       111456  5850
John   M       109349  5850
Robert M       101118  5850

In [65]:
count_dynamics = df_res.groupby(['Gender', 'Year']).sum()
count_dynamics

               Count
Gender Year
F      1900   299798
       1950  1713065
       2000  1815295
M      1900   150480
       1950  1790437
       2000  1963202